// Дана строка. Определить является ли данная строка записью числа (целого или вещественного).
// Дробная и вещественная части разделены десятичной точкой.
#include <stdio.h>

int main() {
   int k = 0; // сколько символов
   int j = 0; // сколько цифр
   int t = 0; // сколько точек
   int ch = 0; // сколько значков
   int per = 22; // первая - цифра или +/-
   int err = 0; // два знака подряд
   char a[1000];
   fgets(a, 1000, stdin);

    for (int i = 0; a[i] != '\n'; i++) {
        k++;
        if (a[i] >= '0' && a[i] <= '9')
        j++;
    }

    for (int i = 0; a[i] != '\n'; i++) {
        if (a[i] < '0' || a[i] > '9')
            ch++;
        if (a[i] == '.') 
            t++;
        if (a[0] == '-' || a[0] == '+') 
            per = 1;
        if (a[0] >= '0' && a[0] <= '9')
            per = 0;
        if (i != k && i != k-1 && (a[i] < '0' || a[i] > '9') && (a[i+1] < '0' || a[i+1] > '9'))
            err = 1;
        if (a[k-1] < '0' || a[k-1] > '9')
            err = 1;
    }  

    if ((per == 1 && t == 0 && j == k-1 && ch == 1 && err == 0) || (per == 0 && t == 0 && j == k && ch == 0 && err == 0)) {
        printf("int");
    } else if ((per == 1 && t == 1 && j == k-2 && j == k-ch && ch == 2 && err == 0) || (per == 0 && t == 1 && j == k-1 && j == k-ch && ch ==1 && err == 0)) {
        printf("float");
    } else {
        printf("error");
    }

  return 0;
}